Revit 2027 API
FabricationDimensionDefinition.Type Property
 Fabrication dimension type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FabricationDimensionType Type { get; }
Public ReadOnly Property Type As FabricationDimensionType
	Get
public:
property FabricationDimensionType Type {
	FabricationDimensionType get ();
}
member Type : FabricationDimensionType with get
Property Value
FabricationDimensionType
See Also
Reference
FabricationDimensionDefinition Class
Autodesk.Revit.DB Namespace